note/2018/emacs-gateway-drug/index.org
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/note/style.css"/>
#+HTML_HEAD_EXTRA: <script type="text/javascript" src="/note/script.js"></script>
#+HTML_LINK_UP: /note
#+HTML_LINK_HOME: /note
#+TITLE: Emacs Gateway Drug
#+DATE: <2018-10-07 Sun>


Every time I try to introduce my friend Emacs, they ask "why?"
Well I can't really think of anything except "you can do anything you want with it".
Of course that statement is too broad and unconvincing.
So I though I'd collect some cool features that can lure my friends into using Emacs.

These tricks must be easily understandable and looks very cool even to laymen.
So here we go:

1. =C-f/b= =M-f/b= =C-a/e=
1. =undo-tree-visualize=
1. Org Mode
1. Keyboard Macros
1. Rectangle Selection
1. query replace
1. inline-replace
1. package installation (that's a bit controversial)
1. regexp-replace
1. (for programming) outshine
1. (mostle for programming) magit
