note/2018/emacs-gateway-drug/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-15 Sat 00:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Gateway Drug</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Emacs Gateway Drug</h1>
<p>
Every time I try to introduce my friend Emacs, they ask "why?" Well I can't really think of anything except "you can do anything you want with it". Of course that statement is too broad and unconvincing. So I though I'd collect some cool features that can lure my friends into using Emacs.
</p>

<p>
These tricks must be easily understandable and looks very cool even to laymen. So here we go:
</p>

<ol class="org-ol">
<li><code>C-f/b</code> <code>M-f/b</code> <code>C-a/e</code></li>
<li><code>undo-tree-visualize</code></li>
<li>Org Mode</li>
<li>Keyboard Macros</li>
<li>Rectangle Selection</li>
<li>query replace</li>
<li>inline-replace</li>
<li>package installation (that's a bit controversial)</li>
<li>regexp-replace</li>
<li>(for programming) outshine</li>
<li>(mostle for programming) magit</li>
</ol>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu</p>
<p class="first-publish">First Published on 2018-10-07 Sun 00:00</p>
<p class-"last-modified">Last modified on 2020-08-15 Sat 00:50</p>
<p>Send your comment to 
<a href="mailto:archive.casouri.cat@gmail.com">
archive.casouri.cat@gmail.com</a></p>
</div>
</body>
</html>
